In [1]:
import pandas

In [7]:
df = pandas.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"],
    }
)

In [3]:
df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [10]:
df1 = df['Age'] + 5

In [13]:
df2 = df[['Name','Age']]

In [14]:
df2

                       Name  Age
0   Braund, Mr. Owen Harris   22
1  Allen, Mr. William Henry   35
2  Bonnell, Miss. Elizabeth   58

In [21]:
df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [32]:
df.iloc[0:2]

                       Name  Age   Sex
0   Braund, Mr. Owen Harris   22  male
1  Allen, Mr. William Henry   35  male

In [42]:
columns=['state_code', 'year', 'population']
population = pandas.read_csv('/workspaces/az-learning/Pandas/historical_state_population_by_year.csv', names=columns)

In [48]:
population[population['state_code']=='KS'][population['year']==2024]

/tmp/ipykernel_5339/4098725847.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  population[population['state_code']=='KS'][population['year']==2024]

     state_code  year  population
2024         KS  2024     2970606

In [49]:
kansas_population = population[population['state_code']=='KS']

In [50]:
kansas_population

     state_code  year  population
1900         KS  1900     1473000
1901         KS  1901     1490000
1902         KS  1902     1505000
1903         KS  1903     1498000
1904         KS  1904     1527000
...         ...   ...         ...
2020         KS  2020     2938172
2021         KS  2021     2938338
2022         KS  2022     2937324
2023         KS  2023     2951500
2024         KS  2024     2970606

[125 rows x 3 columns]

In [54]:
file_name = 'kansas_population_by_year.csv'
kansas_population.to_csv(file_name,index=False)